backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  - [input_2, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 68]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 4]
      dtype: float32
      name: input_2
      sparse: false
    inbound_nodes: []
    name: input_2
  - class_name: Sequential
    config:
      layers:
      - class_name: Embedding
        config:
          activity_regularizer: null
          batch_input_shape: !!python/tuple [null, null]
          dtype: float32
          embeddings_constraint: null
          embeddings_initializer:
            class_name: RandomUniform
            config: {maxval: 0.05, minval: -0.05, seed: null}
          embeddings_regularizer: null
          input_dim: 22
          input_length: null
          mask_zero: false
          name: embedding_1
          output_dim: 64
          trainable: true
      - class_name: Dropout
        config: {name: dropout_1, noise_shape: null, rate: 0.3, seed: null, trainable: true}
      name: sequential_1
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: sequential_1
  - class_name: Sequential
    config:
      layers:
      - class_name: Embedding
        config:
          activity_regularizer: null
          batch_input_shape: !!python/tuple [null, 4]
          dtype: float32
          embeddings_constraint: null
          embeddings_initializer:
            class_name: RandomUniform
            config: {maxval: 0.05, minval: -0.05, seed: null}
          embeddings_regularizer: null
          input_dim: 22
          input_length: 4
          mask_zero: false
          name: embedding_3
          output_dim: 64
          trainable: true
      - class_name: Dropout
        config: {name: dropout_3, noise_shape: null, rate: 0.3, seed: null, trainable: true}
      name: sequential_3
    inbound_nodes:
    - - - input_2
        - 0
        - 0
        - {}
    name: sequential_3
  - class_name: Dot
    config:
      axes: !!python/tuple [2, 2]
      name: dot_1
      normalize: false
      trainable: true
    inbound_nodes:
    - - - sequential_1
        - 1
        - 0
        - &id001 {}
      - - sequential_3
        - 1
        - 0
        - *id001
    name: dot_1
  - class_name: Activation
    config: {activation: softmax, name: activation_1, trainable: true}
    inbound_nodes:
    - - - dot_1
        - 0
        - 0
        - {}
    name: activation_1
  - class_name: Sequential
    config:
      layers:
      - class_name: Embedding
        config:
          activity_regularizer: null
          batch_input_shape: !!python/tuple [null, null]
          dtype: float32
          embeddings_constraint: null
          embeddings_initializer:
            class_name: RandomUniform
            config: {maxval: 0.05, minval: -0.05, seed: null}
          embeddings_regularizer: null
          input_dim: 22
          input_length: null
          mask_zero: false
          name: embedding_2
          output_dim: 4
          trainable: true
      - class_name: Dropout
        config: {name: dropout_2, noise_shape: null, rate: 0.3, seed: null, trainable: true}
      name: sequential_2
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: sequential_2
  - class_name: Add
    config: {name: add_1, trainable: true}
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - &id002 {}
      - - sequential_2
        - 1
        - 0
        - *id002
    name: add_1
  - class_name: Permute
    config:
      dims: !!python/tuple [2, 1]
      name: permute_1
      trainable: true
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - {}
    name: permute_1
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_1, trainable: true}
    inbound_nodes:
    - - - permute_1
        - 0
        - 0
        - &id003 {}
      - - sequential_3
        - 1
        - 0
        - *id003
    name: concatenate_1
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_1
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 32
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: lstm_1
  - class_name: Dropout
    config: {name: dropout_4, noise_shape: null, rate: 0.3, seed: null, trainable: true}
    inbound_nodes:
    - - - lstm_1
        - 0
        - 0
        - {}
    name: dropout_4
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 22
      use_bias: true
    inbound_nodes:
    - - - dropout_4
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Activation
    config: {activation: softmax, name: activation_2, trainable: true}
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: activation_2
  name: model_1
  output_layers:
  - [activation_2, 0, 0]
keras_version: 2.2.4
