backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: Lambda
    config:
      arguments: {horizontal_flip: true, rotation: 8.0}
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      dtype: float32
      function: !!python/tuple
      - '4wQAAAAAAAAAEgAAABAAAABDAAAAcxYCAAB8AGoAdAFqAmsDch50AWoDagR8AHQBagJkAY0CfQB0

        AWoFZAKDAZABj7oBAHQBagZ8AIMBfQR8BGQDGQB8BGQEGQB8BGQFGQADAAIAfQV9Bn0HdAFqB3wH

        dAFqAoMCfQd0AWoHfAZ0AWoCgwJ9BmcAfQh0AWoIZARkA2QDZANkBGQDZANkA2cIdAFqAmQBjQJ9

        CXwBZANrBHLUfAFkBhQAZAcbAH0KdAFqCXwFZwF8CgsAfAqDA30LdAFqCmoDagt8C3wGfAeDA30M

        fAhqDHwMgwEBAHwCkAFyWnQBag10AWoJfAVnAWQDZAiDA2QJgwJ9DWQOZAp8B2QKZAhkCmQKZApn

        CH0OdAFqDnwOdAFqAmQBjQJ9D3QBag90AWoQfA9kA4MCfAVkBGcCgwJ9EHQBag90AWoQfAlkA4MC

        fAVkBGcCgwJ9EXwIagx0AWoRfA18EHwRgwODAQEAfAOQAXLgdAFqDXQBagl8BWcBZANkCIMDZAmD

        An0NZAhkCmQKZApkD3wGZApkCmcIfQ50AWoOfA50AWoCZAGNAn0PdAFqD3QBahB8D2QDgwJ8BWQE

        ZwKDAn0QdAFqD3QBahB8CWQDgwJ8BWQEZwKDAn0RfAhqDHQBahF8DXwQfBGDA4MBAQBXAGQLUQBS

        AFgAfAiQAnISdAFqCmoDahJ8CI4AfQx0AWoKagNqE3wAfAxkDGQNjQN9AHwAUwApEOFAAgAAQXBw

        bHkgYWRkaXRpdmUgYXVnbWVudGF0aW9uIG9uIDJEIGRhdGEuCgogICAgIyBBcmd1bWVudHMKICAg

        ICAgcm90YXRpb246IEEgZmxvYXQsIHRoZSBkZWdyZWUgcmFuZ2UgZm9yIHJvdGF0aW9uICgwIDw9

        IHJvdGF0aW9uIDwgMTgwKSwKICAgICAgICAgIGUuZy4gMyBmb3IgcmFuZG9tIGltYWdlIHJvdGF0

        aW9uIGJldHdlZW4gKC0zLjAsIDMuMCkuCiAgICAgIGhvcml6b250YWxfZmxpcDogQSBib29sZWFu

        LCB3aGV0aGVyIHRvIGFsbG93IHJhbmRvbSBob3Jpem9udGFsIGZsaXAsCiAgICAgICAgICBlLmcu

        IHRydWUgZm9yIDUwJSBwb3NzaWJpbGl0eSB0byBmbGlwIGltYWdlIGhvcml6b250YWxseS4KICAg

        ICAgdmVydGljYWxfZmxpcDogQSBib29sZWFuLCB3aGV0aGVyIHRvIGFsbG93IHJhbmRvbSB2ZXJ0

        aWNhbCBmbGlwLAogICAgICAgICAgZS5nLiB0cnVlIGZvciA1MCUgcG9zc2liaWxpdHkgdG8gZmxp

        cCBpbWFnZSB2ZXJ0aWNhbGx5LgoKICAgICMgUmV0dXJucwogICAgICBpbnB1dCBkYXRhIGFmdGVy

        IGF1Z21lbnRhdGlvbiwgd2hvc2Ugc2hhcGUgaXMgdGhlIHNhbWUgYXMgaXRzIG9yaWdpbmFsLgog

        ICAgKQHaBWR0eXBl2gxhdWdtZW50YXRpb27pAAAAAOkBAAAA6QIAAADnGC1EVPshCUDnAAAAAACA

        ZkDnAAAAAAAA8D/nAAAAAAAA4D/nAAAAAAAAAABO2ghCSUxJTkVBUikB2g1pbnRlcnBvbGF0aW9u

        ZwAAAAAAAPC/ZwAAAAAAAPC/KRRyAgAAANoCdGbaB2Zsb2F0MzLaBWltYWdl2hNjb252ZXJ0X2lt

        YWdlX2R0eXBl2gpuYW1lX3Njb3Bl2gVzaGFwZdoEY2FzdNoIY29uc3RhbnTaDnJhbmRvbV91bmlm

        b3Jt2gdjb250cmli2h9hbmdsZXNfdG9fcHJvamVjdGl2ZV90cmFuc2Zvcm1z2gZhcHBlbmTaBGxl

        c3PaEWNvbnZlcnRfdG9fdGVuc29y2gR0aWxl2gtleHBhbmRfZGltc9oFd2hlcmXaEmNvbXBvc2Vf

        dHJhbnNmb3Jtc9oJdHJhbnNmb3JtKRLaBmlucHV0c9oIcm90YXRpb27aD2hvcml6b250YWxfZmxp

        cNoNdmVydGljYWxfZmxpcNoDc2hw2gpiYXRjaF9zaXpl2gZoZWlnaHTaBXdpZHRo2gp0cmFuc2Zv

        cm1z2ghpZGVudGl0edoJYW5nbGVfcmFk2gZhbmdsZXPaAWbaBGNvaW5yEwAAANoOZmxpcF90cmFu

        c2Zvcm3aBGZsaXDaBm5vZmxpcKkAcjIAAAD6GmNpZmFyMTBfY25uX3RmYXVnbWVudDJkLnB52gph

        dWdtZW50XzJkLAAAAHNCAAAAAA4MARICDgEKARwBDgEOAgQBIAIIAQwBEgEKAQgBCgIGARgBFAEQ

        ARgBGAEUAgYBGAEUARABGAEYAR4CBgEOARQB

        '
      - !!python/tuple [0, false, false]
      - null
      function_type: lambda
      name: lambda_1
      output_shape: null
      output_shape_type: raw
      trainable: true
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_1
      padding: same
      strides: &id002 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
  - class_name: Activation
    config: {activation: relu, name: activation_1, trainable: true}
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_2
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
  - class_name: Activation
    config: {activation: relu, name: activation_2, trainable: true}
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_1
      padding: valid
      pool_size: &id003 !!python/tuple [2, 2]
      strides: *id003
      trainable: true
  - class_name: Dropout
    config: {name: dropout_1, noise_shape: null, rate: 0.25, seed: null, trainable: true}
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_3
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
  - class_name: Activation
    config: {activation: relu, name: activation_3, trainable: true}
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_4
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
  - class_name: Activation
    config: {activation: relu, name: activation_4, trainable: true}
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_2
      padding: valid
      pool_size: &id004 !!python/tuple [2, 2]
      strides: *id004
      trainable: true
  - class_name: Dropout
    config: {name: dropout_2, noise_shape: null, rate: 0.25, seed: null, trainable: true}
  - class_name: Flatten
    config: {data_format: channels_last, name: flatten_1, trainable: true}
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 512
      use_bias: true
  - class_name: Activation
    config: {activation: relu, name: activation_5, trainable: true}
  - class_name: Dropout
    config: {name: dropout_3, noise_shape: null, rate: 0.5, seed: null, trainable: true}
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 10
      use_bias: true
  - class_name: Activation
    config: {activation: softmax, name: activation_6, trainable: true}
  name: sequential_1
keras_version: 2.2.4
