backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_12, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, null, null, 3]
      dtype: float32
      name: input_12
      sparse: false
    inbound_nodes: []
    name: input_12
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_298
      padding: valid
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - input_12
        - 0
        - 0
        - {}
    name: conv2d_298
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_298
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_298
        - 0
        - 0
        - {}
    name: batch_normalization_298
  - class_name: Activation
    config: {activation: relu, name: activation_485, trainable: true}
    inbound_nodes:
    - - - batch_normalization_298
        - 0
        - 0
        - {}
    name: activation_485
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_299
      padding: valid
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_485
        - 0
        - 0
        - {}
    name: conv2d_299
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_299
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_299
        - 0
        - 0
        - {}
    name: batch_normalization_299
  - class_name: Activation
    config: {activation: relu, name: activation_486, trainable: true}
    inbound_nodes:
    - - - batch_normalization_299
        - 0
        - 0
        - {}
    name: activation_486
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_300
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_486
        - 0
        - 0
        - {}
    name: conv2d_300
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_300
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_300
        - 0
        - 0
        - {}
    name: batch_normalization_300
  - class_name: Activation
    config: {activation: relu, name: activation_487, trainable: true}
    inbound_nodes:
    - - - batch_normalization_300
        - 0
        - 0
        - {}
    name: activation_487
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_9
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - activation_487
        - 0
        - 0
        - {}
    name: max_pooling2d_9
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 80
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_301
      padding: valid
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_9
        - 0
        - 0
        - {}
    name: conv2d_301
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_301
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_301
        - 0
        - 0
        - {}
    name: batch_normalization_301
  - class_name: Activation
    config: {activation: relu, name: activation_488, trainable: true}
    inbound_nodes:
    - - - batch_normalization_301
        - 0
        - 0
        - {}
    name: activation_488
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 192
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_302
      padding: valid
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_488
        - 0
        - 0
        - {}
    name: conv2d_302
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_302
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_302
        - 0
        - 0
        - {}
    name: batch_normalization_302
  - class_name: Activation
    config: {activation: relu, name: activation_489, trainable: true}
    inbound_nodes:
    - - - batch_normalization_302
        - 0
        - 0
        - {}
    name: activation_489
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_10
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - activation_489
        - 0
        - 0
        - {}
    name: max_pooling2d_10
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_306
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_10
        - 0
        - 0
        - {}
    name: conv2d_306
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_306
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_306
        - 0
        - 0
        - {}
    name: batch_normalization_306
  - class_name: Activation
    config: {activation: relu, name: activation_493, trainable: true}
    inbound_nodes:
    - - - batch_normalization_306
        - 0
        - 0
        - {}
    name: activation_493
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_304
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_10
        - 0
        - 0
        - {}
    name: conv2d_304
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_307
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_493
        - 0
        - 0
        - {}
    name: conv2d_307
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_304
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_304
        - 0
        - 0
        - {}
    name: batch_normalization_304
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_307
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_307
        - 0
        - 0
        - {}
    name: batch_normalization_307
  - class_name: Activation
    config: {activation: relu, name: activation_491, trainable: true}
    inbound_nodes:
    - - - batch_normalization_304
        - 0
        - 0
        - {}
    name: activation_491
  - class_name: Activation
    config: {activation: relu, name: activation_494, trainable: true}
    inbound_nodes:
    - - - batch_normalization_307
        - 0
        - 0
        - {}
    name: activation_494
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      name: average_pooling2d_11
      padding: same
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_10
        - 0
        - 0
        - {}
    name: average_pooling2d_11
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_303
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_10
        - 0
        - 0
        - {}
    name: conv2d_303
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5, 5]
      name: conv2d_305
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_491
        - 0
        - 0
        - {}
    name: conv2d_305
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_308
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_494
        - 0
        - 0
        - {}
    name: conv2d_308
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_309
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - average_pooling2d_11
        - 0
        - 0
        - {}
    name: conv2d_309
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_303
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_303
        - 0
        - 0
        - {}
    name: batch_normalization_303
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_305
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_305
        - 0
        - 0
        - {}
    name: batch_normalization_305
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_308
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_308
        - 0
        - 0
        - {}
    name: batch_normalization_308
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_309
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_309
        - 0
        - 0
        - {}
    name: batch_normalization_309
  - class_name: Activation
    config: {activation: relu, name: activation_490, trainable: true}
    inbound_nodes:
    - - - batch_normalization_303
        - 0
        - 0
        - {}
    name: activation_490
  - class_name: Activation
    config: {activation: relu, name: activation_492, trainable: true}
    inbound_nodes:
    - - - batch_normalization_305
        - 0
        - 0
        - {}
    name: activation_492
  - class_name: Activation
    config: {activation: relu, name: activation_495, trainable: true}
    inbound_nodes:
    - - - batch_normalization_308
        - 0
        - 0
        - {}
    name: activation_495
  - class_name: Activation
    config: {activation: relu, name: activation_496, trainable: true}
    inbound_nodes:
    - - - batch_normalization_309
        - 0
        - 0
        - {}
    name: activation_496
  - class_name: Concatenate
    config: {axis: 3, name: mixed_5b, trainable: true}
    inbound_nodes:
    - - - activation_490
        - 0
        - 0
        - &id002 {}
      - - activation_492
        - 0
        - 0
        - *id002
      - - activation_495
        - 0
        - 0
        - *id002
      - - activation_496
        - 0
        - 0
        - *id002
    name: mixed_5b
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_313
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed_5b
        - 0
        - 0
        - {}
    name: conv2d_313
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_313
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_313
        - 0
        - 0
        - {}
    name: batch_normalization_313
  - class_name: Activation
    config: {activation: relu, name: activation_500, trainable: true}
    inbound_nodes:
    - - - batch_normalization_313
        - 0
        - 0
        - {}
    name: activation_500
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_311
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed_5b
        - 0
        - 0
        - {}
    name: conv2d_311
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_314
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_500
        - 0
        - 0
        - {}
    name: conv2d_314
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_311
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_311
        - 0
        - 0
        - {}
    name: batch_normalization_311
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_314
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_314
        - 0
        - 0
        - {}
    name: batch_normalization_314
  - class_name: Activation
    config: {activation: relu, name: activation_498, trainable: true}
    inbound_nodes:
    - - - batch_normalization_311
        - 0
        - 0
        - {}
    name: activation_498
  - class_name: Activation
    config: {activation: relu, name: activation_501, trainable: true}
    inbound_nodes:
    - - - batch_normalization_314
        - 0
        - 0
        - {}
    name: activation_501
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_310
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed_5b
        - 0
        - 0
        - {}
    name: conv2d_310
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_312
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_498
        - 0
        - 0
        - {}
    name: conv2d_312
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_315
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_501
        - 0
        - 0
        - {}
    name: conv2d_315
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_310
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_310
        - 0
        - 0
        - {}
    name: batch_normalization_310
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_312
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_312
        - 0
        - 0
        - {}
    name: batch_normalization_312
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_315
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_315
        - 0
        - 0
        - {}
    name: batch_normalization_315
  - class_name: Activation
    config: {activation: relu, name: activation_497, trainable: true}
    inbound_nodes:
    - - - batch_normalization_310
        - 0
        - 0
        - {}
    name: activation_497
  - class_name: Activation
    config: {activation: relu, name: activation_499, trainable: true}
    inbound_nodes:
    - - - batch_normalization_312
        - 0
        - 0
        - {}
    name: activation_499
  - class_name: Activation
    config: {activation: relu, name: activation_502, trainable: true}
    inbound_nodes:
    - - - batch_normalization_315
        - 0
        - 0
        - {}
    name: activation_502
  - class_name: Concatenate
    config: {axis: 3, name: block35_1_mixed, trainable: true}
    inbound_nodes:
    - - - activation_497
        - 0
        - 0
        - &id003 {}
      - - activation_499
        - 0
        - 0
        - *id003
      - - activation_502
        - 0
        - 0
        - *id003
    name: block35_1_mixed
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: block35_1_conv
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - block35_1_mixed
        - 0
        - 0
        - {}
    name: block35_1_conv
  - class_name: Lambda
    config:
      arguments: {scale: 0.17}
      function: !!python/tuple ['4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AGQBGQB8AGQCGQB8ARQAFwBTACkDTukAAAAA6QEA

          AACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPqAL2hvbWUvamFpZGV2ZC9hbmFjb25kYTMv

          bGliL3B5dGhvbjMuNi9zaXRlLXBhY2thZ2VzL0tlcmFzX0FwcGxpY2F0aW9ucy0xLjAuNC1weTMu

          Ni5lZ2cva2VyYXNfYXBwbGljYXRpb25zL2luY2VwdGlvbl9yZXNuZXRfdjIucHnaCDxsYW1iZGE+

          qgAAAPMAAAAA

          ', null, null]
      function_type: lambda
      name: block35_1
      output_shape: !!python/tuple [null, null, 320]
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - mixed_5b
        - 0
        - 0
        - &id004 {}
      - - block35_1_conv
        - 0
        - 0
        - *id004
    name: block35_1
  - class_name: Activation
    config: {activation: relu, name: block35_1_ac, trainable: true}
    inbound_nodes:
    - - - block35_1
        - 0
        - 0
        - {}
    name: block35_1_ac
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_319
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - block35_1_ac
        - 0
        - 0
        - {}
    name: conv2d_319
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_319
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_319
        - 0
        - 0
        - {}
    name: batch_normalization_319
  - class_name: Activation
    config: {activation: relu, name: activation_506, trainable: true}
    inbound_nodes:
    - - - batch_normalization_319
        - 0
        - 0
        - {}
    name: activation_506
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_317
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - block35_1_ac
        - 0
        - 0
        - {}
    name: conv2d_317
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_320
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_506
        - 0
        - 0
        - {}
    name: conv2d_320
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_317
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_317
        - 0
        - 0
        - {}
    name: batch_normalization_317
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_320
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_320
        - 0
        - 0
        - {}
    name: batch_normalization_320
  - class_name: Activation
    config: {activation: relu, name: activation_504, trainable: true}
    inbound_nodes:
    - - - batch_normalization_317
        - 0
        - 0
        - {}
    name: activation_504
  - class_name: Activation
    config: {activation: relu, name: activation_507, trainable: true}
    inbound_nodes:
    - - - batch_normalization_320
        - 0
        - 0
        - {}
    name: activation_507
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_316
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - block35_1_ac
        - 0
        - 0
        - {}
    name: conv2d_316
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_318
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_504
        - 0
        - 0
        - {}
    name: conv2d_318
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_321
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_507
        - 0
        - 0
        - {}
    name: conv2d_321
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_316
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_316
        - 0
        - 0
        - {}
    name: batch_normalization_316
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_318
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_318
        - 0
        - 0
        - {}
    name: batch_normalization_318
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_321
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_321
        - 0
        - 0
        - {}
    name: batch_normalization_321
  - class_name: Activation
    config: {activation: relu, name: activation_503, trainable: true}
    inbound_nodes:
    - - - batch_normalization_316
        - 0
        - 0
        - {}
    name: activation_503
  - class_name: Activation
    config: {activation: relu, name: activation_505, trainable: true}
    inbound_nodes:
    - - - batch_normalization_318
        - 0
        - 0
        - {}
    name: activation_505
  - class_name: Activation
    config: {activation: relu, name: activation_508, trainable: true}
    inbound_nodes:
    - - - batch_normalization_321
        - 0
        - 0
        - {}
    name: activation_508
  - class_name: Concatenate
    config: {axis: 3, name: block35_2_mixed, trainable: true}
    inbound_nodes:
    - - - activation_503
        - 0
        - 0
        - &id005 {}
      - - activation_505
        - 0
        - 0
        - *id005
      - - activation_508
        - 0
        - 0
        - *id005
    name: block35_2_mixed
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: block35_2_conv
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - block35_2_mixed
        - 0
        - 0
        - {}
    name: block35_2_conv
  - class_name: Lambda
    config:
      arguments: {scale: 0.17}
      function: !!python/tuple ['4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AGQBGQB8AGQCGQB8ARQAFwBTACkDTukAAAAA6QEA

          AACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPqAL2hvbWUvamFpZGV2ZC9hbmFjb25kYTMv

          bGliL3B5dGhvbjMuNi9zaXRlLXBhY2thZ2VzL0tlcmFzX0FwcGxpY2F0aW9ucy0xLjAuNC1weTMu

          Ni5lZ2cva2VyYXNfYXBwbGljYXRpb25zL2luY2VwdGlvbl9yZXNuZXRfdjIucHnaCDxsYW1iZGE+

          qgAAAPMAAAAA

          ', null, null]
      function_type: lambda
      name: block35_2
      output_shape: !!python/tuple [null, null, 320]
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - block35_1_ac
        - 0
        - 0
        - &id006 {}
      - - block35_2_conv
        - 0
        - 0
        - *id006
    name: block35_2
  - class_name: Activation
    config: {activation: relu, name: block35_2_ac, trainable: true}
    inbound_nodes:
    - - - block35_2
        - 0
        - 0
        - {}
    name: block35_2_ac
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_325
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - block35_2_ac
        - 0
        - 0
        - {}
    name: conv2d_325
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_325
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_325
        - 0
        - 0
        - {}
    name: batch_normalization_325
  - class_name: Activation
    config: {activation: relu, name: activation_512, trainable: true}
    inbound_nodes:
    - - - batch_normalization_325
        - 0
        - 0
        - {}
    name: activation_512
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_323
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - block35_2_ac
        - 0
        - 0
        - {}
    name: conv2d_323
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_326
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_512
        - 0
        - 0
        - {}
    name: conv2d_326
  - class_name: BatchNormalization
    config:
      axis: 3
