backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_13, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, null, null, 3]
      dtype: float32
      name: input_13
      sparse: false
    inbound_nodes: []
    name: input_13
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_501
      padding: valid
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - input_13
        - 0
        - 0
        - {}
    name: conv2d_501
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_501
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_501
        - 0
        - 0
        - {}
    name: batch_normalization_501
  - class_name: Activation
    config: {activation: relu, name: activation_688, trainable: true}
    inbound_nodes:
    - - - batch_normalization_501
        - 0
        - 0
        - {}
    name: activation_688
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_502
      padding: valid
      strides: &id002 !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_688
        - 0
        - 0
        - {}
    name: conv2d_502
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_502
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_502
        - 0
        - 0
        - {}
    name: batch_normalization_502
  - class_name: Activation
    config: {activation: relu, name: activation_689, trainable: true}
    inbound_nodes:
    - - - batch_normalization_502
        - 0
        - 0
        - {}
    name: activation_689
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_503
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_689
        - 0
        - 0
        - {}
    name: conv2d_503
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_503
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_503
        - 0
        - 0
        - {}
    name: batch_normalization_503
  - class_name: Activation
    config: {activation: relu, name: activation_690, trainable: true}
    inbound_nodes:
    - - - batch_normalization_503
        - 0
        - 0
        - {}
    name: activation_690
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_13
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - activation_690
        - 0
        - 0
        - {}
    name: max_pooling2d_13
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 80
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_504
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_13
        - 0
        - 0
        - {}
    name: conv2d_504
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_504
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_504
        - 0
        - 0
        - {}
    name: batch_normalization_504
  - class_name: Activation
    config: {activation: relu, name: activation_691, trainable: true}
    inbound_nodes:
    - - - batch_normalization_504
        - 0
        - 0
        - {}
    name: activation_691
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 192
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_505
      padding: valid
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_691
        - 0
        - 0
        - {}
    name: conv2d_505
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_505
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_505
        - 0
        - 0
        - {}
    name: batch_normalization_505
  - class_name: Activation
    config: {activation: relu, name: activation_692, trainable: true}
    inbound_nodes:
    - - - batch_normalization_505
        - 0
        - 0
        - {}
    name: activation_692
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_14
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - activation_692
        - 0
        - 0
        - {}
    name: max_pooling2d_14
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_509
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_14
        - 0
        - 0
        - {}
    name: conv2d_509
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_509
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_509
        - 0
        - 0
        - {}
    name: batch_normalization_509
  - class_name: Activation
    config: {activation: relu, name: activation_696, trainable: true}
    inbound_nodes:
    - - - batch_normalization_509
        - 0
        - 0
        - {}
    name: activation_696
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_507
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_14
        - 0
        - 0
        - {}
    name: conv2d_507
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_510
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_696
        - 0
        - 0
        - {}
    name: conv2d_510
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_507
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_507
        - 0
        - 0
        - {}
    name: batch_normalization_507
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_510
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_510
        - 0
        - 0
        - {}
    name: batch_normalization_510
  - class_name: Activation
    config: {activation: relu, name: activation_694, trainable: true}
    inbound_nodes:
    - - - batch_normalization_507
        - 0
        - 0
        - {}
    name: activation_694
  - class_name: Activation
    config: {activation: relu, name: activation_697, trainable: true}
    inbound_nodes:
    - - - batch_normalization_510
        - 0
        - 0
        - {}
    name: activation_697
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      name: average_pooling2d_12
      padding: same
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_14
        - 0
        - 0
        - {}
    name: average_pooling2d_12
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_506
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - max_pooling2d_14
        - 0
        - 0
        - {}
    name: conv2d_506
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5, 5]
      name: conv2d_508
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_694
        - 0
        - 0
        - {}
    name: conv2d_508
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_511
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_697
        - 0
        - 0
        - {}
    name: conv2d_511
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_512
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - average_pooling2d_12
        - 0
        - 0
        - {}
    name: conv2d_512
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_506
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_506
        - 0
        - 0
        - {}
    name: batch_normalization_506
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_508
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_508
        - 0
        - 0
        - {}
    name: batch_normalization_508
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_511
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_511
        - 0
        - 0
        - {}
    name: batch_normalization_511
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_512
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_512
        - 0
        - 0
        - {}
    name: batch_normalization_512
  - class_name: Activation
    config: {activation: relu, name: activation_693, trainable: true}
    inbound_nodes:
    - - - batch_normalization_506
        - 0
        - 0
        - {}
    name: activation_693
  - class_name: Activation
    config: {activation: relu, name: activation_695, trainable: true}
    inbound_nodes:
    - - - batch_normalization_508
        - 0
        - 0
        - {}
    name: activation_695
  - class_name: Activation
    config: {activation: relu, name: activation_698, trainable: true}
    inbound_nodes:
    - - - batch_normalization_511
        - 0
        - 0
        - {}
    name: activation_698
  - class_name: Activation
    config: {activation: relu, name: activation_699, trainable: true}
    inbound_nodes:
    - - - batch_normalization_512
        - 0
        - 0
        - {}
    name: activation_699
  - class_name: Concatenate
    config: {axis: 3, name: mixed0, trainable: true}
    inbound_nodes:
    - - - activation_693
        - 0
        - 0
        - &id003 {}
      - - activation_695
        - 0
        - 0
        - *id003
      - - activation_698
        - 0
        - 0
        - *id003
      - - activation_699
        - 0
        - 0
        - *id003
    name: mixed0
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_516
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed0
        - 0
        - 0
        - {}
    name: conv2d_516
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_516
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_516
        - 0
        - 0
        - {}
    name: batch_normalization_516
  - class_name: Activation
    config: {activation: relu, name: activation_703, trainable: true}
    inbound_nodes:
    - - - batch_normalization_516
        - 0
        - 0
        - {}
    name: activation_703
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_514
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed0
        - 0
        - 0
        - {}
    name: conv2d_514
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_517
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_703
        - 0
        - 0
        - {}
    name: conv2d_517
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_514
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_514
        - 0
        - 0
        - {}
    name: batch_normalization_514
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_517
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_517
        - 0
        - 0
        - {}
    name: batch_normalization_517
  - class_name: Activation
    config: {activation: relu, name: activation_701, trainable: true}
    inbound_nodes:
    - - - batch_normalization_514
        - 0
        - 0
        - {}
    name: activation_701
  - class_name: Activation
    config: {activation: relu, name: activation_704, trainable: true}
    inbound_nodes:
    - - - batch_normalization_517
        - 0
        - 0
        - {}
    name: activation_704
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      name: average_pooling2d_13
      padding: same
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - mixed0
        - 0
        - 0
        - {}
    name: average_pooling2d_13
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_513
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed0
        - 0
        - 0
        - {}
    name: conv2d_513
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5, 5]
      name: conv2d_515
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_701
        - 0
        - 0
        - {}
    name: conv2d_515
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_518
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_704
        - 0
        - 0
        - {}
    name: conv2d_518
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_519
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - average_pooling2d_13
        - 0
        - 0
        - {}
    name: conv2d_519
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_513
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_513
        - 0
        - 0
        - {}
    name: batch_normalization_513
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_515
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_515
        - 0
        - 0
        - {}
    name: batch_normalization_515
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_518
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_518
        - 0
        - 0
        - {}
    name: batch_normalization_518
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_519
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_519
        - 0
        - 0
        - {}
    name: batch_normalization_519
  - class_name: Activation
    config: {activation: relu, name: activation_700, trainable: true}
    inbound_nodes:
    - - - batch_normalization_513
        - 0
        - 0
        - {}
    name: activation_700
  - class_name: Activation
    config: {activation: relu, name: activation_702, trainable: true}
    inbound_nodes:
    - - - batch_normalization_515
        - 0
        - 0
        - {}
    name: activation_702
  - class_name: Activation
    config: {activation: relu, name: activation_705, trainable: true}
    inbound_nodes:
    - - - batch_normalization_518
        - 0
        - 0
        - {}
    name: activation_705
  - class_name: Activation
    config: {activation: relu, name: activation_706, trainable: true}
    inbound_nodes:
    - - - batch_normalization_519
        - 0
        - 0
        - {}
    name: activation_706
  - class_name: Concatenate
    config: {axis: 3, name: mixed1, trainable: true}
    inbound_nodes:
    - - - activation_700
        - 0
        - 0
        - &id004 {}
      - - activation_702
        - 0
        - 0
        - *id004
      - - activation_705
        - 0
        - 0
        - *id004
      - - activation_706
        - 0
        - 0
        - *id004
    name: mixed1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_523
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed1
        - 0
        - 0
        - {}
    name: conv2d_523
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_523
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_523
        - 0
        - 0
        - {}
    name: batch_normalization_523
  - class_name: Activation
    config: {activation: relu, name: activation_710, trainable: true}
    inbound_nodes:
    - - - batch_normalization_523
        - 0
        - 0
        - {}
    name: activation_710
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_521
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed1
        - 0
        - 0
        - {}
    name: conv2d_521
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_524
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_710
        - 0
        - 0
        - {}
    name: conv2d_524
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_521
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_521
        - 0
        - 0
        - {}
    name: batch_normalization_521
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_524
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_524
        - 0
        - 0
        - {}
    name: batch_normalization_524
  - class_name: Activation
    config: {activation: relu, name: activation_708, trainable: true}
    inbound_nodes:
    - - - batch_normalization_521
        - 0
        - 0
        - {}
    name: activation_708
  - class_name: Activation
    config: {activation: relu, name: activation_711, trainable: true}
    inbound_nodes:
    - - - batch_normalization_524
        - 0
        - 0
        - {}
    name: activation_711
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      name: average_pooling2d_14
      padding: same
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - mixed1
        - 0
        - 0
        - {}
    name: average_pooling2d_14
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_520
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed1
        - 0
        - 0
        - {}
    name: conv2d_520
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5, 5]
      name: conv2d_522
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_708
        - 0
        - 0
        - {}
    name: conv2d_522
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_525
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_711
        - 0
        - 0
        - {}
    name: conv2d_525
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_526
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - average_pooling2d_14
        - 0
        - 0
        - {}
    name: conv2d_526
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_520
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_520
        - 0
        - 0
        - {}
    name: batch_normalization_520
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_522
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_522
        - 0
        - 0
        - {}
    name: batch_normalization_522
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_525
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_525
        - 0
        - 0
        - {}
    name: batch_normalization_525
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_526
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_526
        - 0
        - 0
        - {}
    name: batch_normalization_526
  - class_name: Activation
    config: {activation: relu, name: activation_707, trainable: true}
    inbound_nodes:
    - - - batch_normalization_520
        - 0
        - 0
        - {}
    name: activation_707
  - class_name: Activation
    config: {activation: relu, name: activation_709, trainable: true}
    inbound_nodes:
    - - - batch_normalization_522
        - 0
        - 0
        - {}
    name: activation_709
  - class_name: Activation
    config: {activation: relu, name: activation_712, trainable: true}
    inbound_nodes:
    - - - batch_normalization_525
        - 0
        - 0
        - {}
    name: activation_712
  - class_name: Activation
    config: {activation: relu, name: activation_713, trainable: true}
    inbound_nodes:
    - - - batch_normalization_526
        - 0
        - 0
        - {}
    name: activation_713
  - class_name: Concatenate
    config: {axis: 3, name: mixed2, trainable: true}
    inbound_nodes:
    - - - activation_707
        - 0
        - 0
        - &id005 {}
      - - activation_709
        - 0
        - 0
        - *id005
      - - activation_712
        - 0
        - 0
        - *id005
      - - activation_713
        - 0
        - 0
        - *id005
    name: mixed2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_528
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - mixed2
        - 0
        - 0
        - {}
    name: conv2d_528
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_528
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_528
        - 0
        - 0
        - {}
    name: batch_normalization_528
  - class_name: Activation
    config: {activation: relu, name: activation_715, trainable: true}
    inbound_nodes:
    - - - batch_normalization_528
        - 0
        - 0
        - {}
    name: activation_715
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_529
      padding: same
      strides: *id002
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_715
        - 0
        - 0
        - {}
    name: conv2d_529
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_529
      scale: false
      trainable: true
    inbound_nodes:
    - - - conv2d_529
        - 0
