backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_2, 0, 0]
  - [input_3, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 28, 28]
      dtype: float32
      name: input_2
      sparse: false
    inbound_nodes: []
    name: input_2
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 28, 28]
      dtype: float32
      name: input_3
      sparse: false
    inbound_nodes: []
    name: input_3
  - class_name: Model
    config:
      input_layers:
      - [input_1, 0, 0]
      layers:
      - class_name: InputLayer
        config:
          batch_input_shape: !!python/tuple [null, 28, 28]
          dtype: float32
          name: input_1
          sparse: false
        inbound_nodes: []
        name: input_1
      - class_name: Flatten
        config: {data_format: channels_last, name: flatten_1, trainable: true}
        inbound_nodes:
        - - - input_1
            - 0
            - 0
            - {}
        name: flatten_1
      - class_name: Dense
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: dense_1
          trainable: true
          units: 128
          use_bias: true
        inbound_nodes:
        - - - flatten_1
            - 0
            - 0
            - {}
        name: dense_1
      - class_name: Dropout
        config: {name: dropout_1, noise_shape: null, rate: 0.1, seed: null, trainable: true}
        inbound_nodes:
        - - - dense_1
            - 0
            - 0
            - {}
        name: dropout_1
      - class_name: Dense
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: dense_2
          trainable: true
          units: 128
          use_bias: true
        inbound_nodes:
        - - - dropout_1
            - 0
            - 0
            - {}
        name: dense_2
      - class_name: Dropout
        config: {name: dropout_2, noise_shape: null, rate: 0.1, seed: null, trainable: true}
        inbound_nodes:
        - - - dense_2
            - 0
            - 0
            - {}
        name: dropout_2
      - class_name: Dense
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: dense_3
          trainable: true
          units: 128
          use_bias: true
        inbound_nodes:
        - - - dropout_2
            - 0
            - 0
            - {}
        name: dense_3
      name: model_1
      output_layers:
      - [dense_3, 0, 0]
    inbound_nodes:
    - - - input_2
        - 0
        - 0
        - {}
    - - - input_3
        - 0
        - 0
        - {}
    name: model_1
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple ['4wEAAAAAAAAABAAAAAUAAABDAAAAczgAAAB8AFwCfQF9AnQAagF0AGoCfAF8AhgAgwFkAWQCZAON

          A30DdABqA3QAagR8A3QAagWDAIMCgwFTACkETukBAAAAVCkC2gRheGlz2ghrZWVwZGltcykG2gFL

          2gNzdW3aBnNxdWFyZdoEc3FydNoHbWF4aW11bdoHZXBzaWxvbikE2gV2ZWN0c9oBeNoBedoKc3Vt

          X3NxdWFyZakAcg4AAAD6EG1uaXN0X3NpYW1lc2UucHnaEmV1Y2xpZGVhbl9kaXN0YW5jZR4AAABz

          BgAAAAABCAEaAQ==

          ', null, null]
      function_type: lambda
      name: lambda_1
      output_shape: !!python/tuple ['4wEAAAAAAAAAAwAAAAIAAABDAAAAcxQAAAB8AFwCfQF9AnwBZAEZAGQCZgJTACkDTukAAAAA6QEA

          AACpACkD2gZzaGFwZXPaBnNoYXBlMdoGc2hhcGUycgMAAAByAwAAAPoQbW5pc3Rfc2lhbWVzZS5w

          edoWZXVjbF9kaXN0X291dHB1dF9zaGFwZSQAAABzBAAAAAABCAE=

          ', null, null]
      output_shape_type: lambda
      trainable: true
    inbound_nodes:
    - - - model_1
        - 1
        - 0
        - &id001 {}
      - - model_1
        - 2
        - 0
        - *id001
    name: lambda_1
  name: model_2
  output_layers:
  - [lambda_1, 0, 0]
keras_version: 2.2.4
