backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_16, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 331, 331, 3]
      dtype: float32
      name: input_16
      sparse: false
    inbound_nodes: []
    name: input_16
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: stem_conv1
      padding: valid
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - input_16
        - 0
        - 0
        - {}
    name: stem_conv1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: stem_bn1
      scale: true
      trainable: true
    inbound_nodes:
    - - - stem_conv1
        - 0
        - 0
        - {}
    name: stem_bn1
  - class_name: Activation
    config: {activation: relu, name: activation_782, trainable: true}
    inbound_nodes:
    - - - stem_bn1
        - 0
        - 0
        - {}
    name: activation_782
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 42
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id016 !!python/tuple [1, 1]
      name: reduction_conv_1_stem_1
      padding: same
      strides: &id017 !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_782
        - 0
        - 0
        - {}
    name: reduction_conv_1_stem_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: reduction_bn_1_stem_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - reduction_conv_1_stem_1
        - 0
        - 0
        - {}
    name: reduction_bn_1_stem_1
  - class_name: Activation
    config: {activation: relu, name: activation_783, trainable: true}
    inbound_nodes:
    - - - reduction_bn_1_stem_1
        - 0
        - 0
        - {}
    name: activation_783
  - class_name: Activation
    config: {activation: relu, name: activation_785, trainable: true}
    inbound_nodes:
    - - - stem_bn1
        - 0
        - 0
        - {}
    name: activation_785
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: &id002 !!python/tuple [1, 1]
      filters: 42
      kernel_size: &id003 !!python/tuple [5, 5]
      name: separable_conv_1_reduction_left1_stem_1
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: &id019 !!python/tuple [2, 2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_783
        - 0
        - 0
        - {}
    name: separable_conv_1_reduction_left1_stem_1
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 42
      kernel_size: &id004 !!python/tuple [7, 7]
      name: separable_conv_1_reduction_right1_stem_1
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: &id020 !!python/tuple [2, 2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_785
        - 0
        - 0
        - {}
    name: separable_conv_1_reduction_right1_stem_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_1_bn_reduction_left1_stem_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_1_reduction_left1_stem_1
        - 0
        - 0
        - {}
    name: separable_conv_1_bn_reduction_left1_stem_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_1_bn_reduction_right1_stem_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_1_reduction_right1_stem_1
        - 0
        - 0
        - {}
    name: separable_conv_1_bn_reduction_right1_stem_1
  - class_name: Activation
    config: {activation: relu, name: activation_784, trainable: true}
    inbound_nodes:
    - - - separable_conv_1_bn_reduction_left1_stem_1
        - 0
        - 0
        - {}
    name: activation_784
  - class_name: Activation
    config: {activation: relu, name: activation_786, trainable: true}
    inbound_nodes:
    - - - separable_conv_1_bn_reduction_right1_stem_1
        - 0
        - 0
        - {}
    name: activation_786
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 42
      kernel_size: *id003
      name: separable_conv_2_reduction_left1_stem_1
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: &id005 !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_784
        - 0
        - 0
        - {}
    name: separable_conv_2_reduction_left1_stem_1
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 42
      kernel_size: *id004
      name: separable_conv_2_reduction_right1_stem_1
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: *id005
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_786
        - 0
        - 0
        - {}
    name: separable_conv_2_reduction_right1_stem_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_2_bn_reduction_left1_stem_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_2_reduction_left1_stem_1
        - 0
        - 0
        - {}
    name: separable_conv_2_bn_reduction_left1_stem_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_2_bn_reduction_right1_stem_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_2_reduction_right1_stem_1
        - 0
        - 0
        - {}
    name: separable_conv_2_bn_reduction_right1_stem_1
  - class_name: Activation
    config: {activation: relu, name: activation_787, trainable: true}
    inbound_nodes:
    - - - stem_bn1
        - 0
        - 0
        - {}
    name: activation_787
  - class_name: Add
    config: {name: reduction_add_1_stem_1, trainable: true}
    inbound_nodes:
    - - - separable_conv_2_bn_reduction_left1_stem_1
        - 0
        - 0
        - &id006 {}
      - - separable_conv_2_bn_reduction_right1_stem_1
        - 0
        - 0
        - *id006
    name: reduction_add_1_stem_1
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 42
      kernel_size: &id007 !!python/tuple [7, 7]
      name: separable_conv_1_reduction_right2_stem_1
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: &id022 !!python/tuple [2, 2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_787
        - 0
        - 0
        - {}
    name: separable_conv_1_reduction_right2_stem_1
  - class_name: Activation
    config: {activation: relu, name: activation_789, trainable: true}
    inbound_nodes:
    - - - stem_bn1
        - 0
        - 0
        - {}
    name: activation_789
  - class_name: Activation
    config: {activation: relu, name: activation_791, trainable: true}
    inbound_nodes:
    - - - reduction_add_1_stem_1
        - 0
        - 0
        - {}
    name: activation_791
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_1_bn_reduction_right2_stem_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_1_reduction_right2_stem_1
        - 0
        - 0
        - {}
    name: separable_conv_1_bn_reduction_right2_stem_1
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 42
      kernel_size: &id008 !!python/tuple [5, 5]
      name: separable_conv_1_reduction_right3_stem_1
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: &id023 !!python/tuple [2, 2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_789
        - 0
        - 0
        - {}
    name: separable_conv_1_reduction_right3_stem_1
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 42
      kernel_size: &id009 !!python/tuple [3, 3]
      name: separable_conv_1_reduction_left4_stem_1
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: &id024 !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_791
        - 0
        - 0
        - {}
    name: separable_conv_1_reduction_left4_stem_1
  - class_name: Activation
    config: {activation: relu, name: activation_788, trainable: true}
    inbound_nodes:
    - - - separable_conv_1_bn_reduction_right2_stem_1
        - 0
        - 0
        - {}
    name: activation_788
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_1_bn_reduction_right3_stem_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_1_reduction_right3_stem_1
        - 0
        - 0
        - {}
    name: separable_conv_1_bn_reduction_right3_stem_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_1_bn_reduction_left4_stem_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_1_reduction_left4_stem_1
        - 0
        - 0
        - {}
    name: separable_conv_1_bn_reduction_left4_stem_1
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 42
      kernel_size: *id007
      name: separable_conv_2_reduction_right2_stem_1
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: *id005
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_788
        - 0
        - 0
        - {}
    name: separable_conv_2_reduction_right2_stem_1
  - class_name: Activation
    config: {activation: relu, name: activation_790, trainable: true}
    inbound_nodes:
    - - - separable_conv_1_bn_reduction_right3_stem_1
        - 0
        - 0
        - {}
    name: activation_790
  - class_name: Activation
    config: {activation: relu, name: activation_792, trainable: true}
    inbound_nodes:
    - - - separable_conv_1_bn_reduction_left4_stem_1
        - 0
        - 0
        - {}
    name: activation_792
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: reduction_left2_stem_1
      padding: same
      pool_size: &id025 !!python/tuple [3, 3]
      strides: &id026 !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - reduction_bn_1_stem_1
        - 0
        - 0
        - {}
    name: reduction_left2_stem_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_2_bn_reduction_right2_stem_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_2_reduction_right2_stem_1
        - 0
        - 0
        - {}
    name: separable_conv_2_bn_reduction_right2_stem_1
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 42
      kernel_size: *id008
      name: separable_conv_2_reduction_right3_stem_1
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: *id005
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_790
        - 0
        - 0
        - {}
    name: separable_conv_2_reduction_right3_stem_1
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 42
      kernel_size: *id009
      name: separable_conv_2_reduction_left4_stem_1
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: *id005
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_792
        - 0
        - 0
        - {}
    name: separable_conv_2_reduction_left4_stem_1
  - class_name: Activation
    config: {activation: relu, name: adjust_relu_1_stem_2, trainable: true}
    inbound_nodes:
    - - - stem_bn1
        - 0
        - 0
        - {}
    name: adjust_relu_1_stem_2
  - class_name: Add
    config: {name: reduction_add_2_stem_1, trainable: true}
    inbound_nodes:
    - - - reduction_left2_stem_1
        - 0
        - 0
        - &id010 {}
      - - separable_conv_2_bn_reduction_right2_stem_1
        - 0
        - 0
        - *id010
    name: reduction_add_2_stem_1
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      name: reduction_left3_stem_1
      padding: same
      pool_size: &id028 !!python/tuple [3, 3]
      strides: &id029 !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - reduction_bn_1_stem_1
        - 0
        - 0
        - {}
    name: reduction_left3_stem_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_2_bn_reduction_right3_stem_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_2_reduction_right3_stem_1
        - 0
        - 0
        - {}
    name: separable_conv_2_bn_reduction_right3_stem_1
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      name: reduction_left4_stem_1
      padding: same
      pool_size: &id030 !!python/tuple [3, 3]
      strides: &id031 !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - reduction_add_1_stem_1
        - 0
        - 0
        - {}
    name: reduction_left4_stem_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_2_bn_reduction_left4_stem_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_2_reduction_left4_stem_1
        - 0
        - 0
        - {}
    name: separable_conv_2_bn_reduction_left4_stem_1
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: reduction_right5_stem_1
      padding: same
      pool_size: &id032 !!python/tuple [3, 3]
      strides: &id033 !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - reduction_bn_1_stem_1
        - 0
        - 0
        - {}
    name: reduction_right5_stem_1
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      name: zero_padding2d_16
      padding: !!python/tuple
      - &id034 !!python/tuple [0, 1]
      - &id035 !!python/tuple [0, 1]
      trainable: true
    inbound_nodes:
    - - - adjust_relu_1_stem_2
        - 0
        - 0
        - {}
    name: zero_padding2d_16
  - class_name: Add
    config: {name: reduction_add3_stem_1, trainable: true}
    inbound_nodes:
    - - - reduction_left3_stem_1
        - 0
        - 0
        - &id011 {}
      - - separable_conv_2_bn_reduction_right3_stem_1
        - 0
        - 0
        - *id011
    name: reduction_add3_stem_1
  - class_name: Add
    config: {name: add_5, trainable: true}
    inbound_nodes:
    - - - reduction_add_2_stem_1
        - 0
        - 0
        - &id012 {}
      - - reduction_left4_stem_1
        - 0
        - 0
        - *id012
    name: add_5
  - class_name: Add
    config: {name: reduction_add4_stem_1, trainable: true}
    inbound_nodes:
    - - - separable_conv_2_bn_reduction_left4_stem_1
        - 0
        - 0
        - &id013 {}
      - - reduction_right5_stem_1
        - 0
        - 0
        - *id013
    name: reduction_add4_stem_1
  - class_name: Cropping2D
    config:
      cropping: !!python/tuple
      - &id039 !!python/tuple [1, 0]
      - &id040 !!python/tuple [1, 0]
      data_format: channels_last
      name: cropping2d_4
      trainable: true
    inbound_nodes:
    - - - zero_padding2d_16
        - 0
        - 0
        - {}
    name: cropping2d_4
  - class_name: Concatenate
    config: {axis: -1, name: reduction_concat_stem_1, trainable: true}
    inbound_nodes:
    - - - reduction_add_2_stem_1
        - 0
        - 0
        - &id014 {}
      - - reduction_add3_stem_1
        - 0
        - 0
        - *id014
      - - add_5
        - 0
        - 0
        - *id014
      - - reduction_add4_stem_1
        - 0
        - 0
        - *id014
    name: reduction_concat_stem_1
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      name: adjust_avg_pool_1_stem_2
      padding: valid
      pool_size: &id042 !!python/tuple [1, 1]
      strides: &id043 !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - adjust_relu_1_stem_2
        - 0
        - 0
        - {}
    name: adjust_avg_pool_1_stem_2
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      name: adjust_avg_pool_2_stem_2
      padding: valid
      pool_size: &id044 !!python/tuple [1, 1]
      strides: &id045 !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - cropping2d_4
        - 0
        - 0
        - {}
    name: adjust_avg_pool_2_stem_2
  - class_name: Activation
    config: {activation: relu, name: activation_793, trainable: true}
    inbound_nodes:
    - - - reduction_concat_stem_1
        - 0
        - 0
        - {}
    name: activation_793
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 42
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id046 !!python/tuple [1, 1]
      name: adjust_conv_1_stem_2
      padding: same
      strides: &id015 !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - adjust_avg_pool_1_stem_2
        - 0
        - 0
        - {}
    name: adjust_conv_1_stem_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 42
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id047 !!python/tuple [1, 1]
      name: adjust_conv_2_stem_2
      padding: same
      strides: *id015
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - adjust_avg_pool_2_stem_2
        - 0
        - 0
        - {}
    name: adjust_conv_2_stem_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 84
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id016
      name: reduction_conv_1_stem_2
      padding: same
      strides: *id017
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_793
        - 0
        - 0
        - {}
    name: reduction_conv_1_stem_2
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_8, trainable: true}
    inbound_nodes:
    - - - adjust_conv_1_stem_2
        - 0
        - 0
        - &id018 {}
      - - adjust_conv_2_stem_2
        - 0
        - 0
        - *id018
    name: concatenate_8
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: reduction_bn_1_stem_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - reduction_conv_1_stem_2
        - 0
        - 0
        - {}
    name: reduction_bn_1_stem_2
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: adjust_bn_stem_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - concatenate_8
        - 0
        - 0
        - {}
    name: adjust_bn_stem_2
  - class_name: Activation
    config: {activation: relu, name: activation_794, trainable: true}
    inbound_nodes:
    - - - reduction_bn_1_stem_2
        - 0
        - 0
        - {}
    name: activation_794
  - class_name: Activation
    config: {activation: relu, name: activation_796, trainable: true}
    inbound_nodes:
    - - - adjust_bn_stem_2
        - 0
        - 0
        - {}
    name: activation_796
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 84
      kernel_size: *id003
      name: separable_conv_1_reduction_left1_stem_2
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: *id019
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_794
        - 0
        - 0
        - {}
    name: separable_conv_1_reduction_left1_stem_2
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 84
      kernel_size: *id004
      name: separable_conv_1_reduction_right1_stem_2
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: *id020
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_796
        - 0
        - 0
        - {}
    name: separable_conv_1_reduction_right1_stem_2
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_1_bn_reduction_left1_stem_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_1_reduction_left1_stem_2
        - 0
        - 0
        - {}
    name: separable_conv_1_bn_reduction_left1_stem_2
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_1_bn_reduction_right1_stem_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_1_reduction_right1_stem_2
        - 0
        - 0
        - {}
    name: separable_conv_1_bn_reduction_right1_stem_2
  - class_name: Activation
    config: {activation: relu, name: activation_795, trainable: true}
    inbound_nodes:
    - - - separable_conv_1_bn_reduction_left1_stem_2
        - 0
        - 0
        - {}
    name: activation_795
  - class_name: Activation
    config: {activation: relu, name: activation_797, trainable: true}
    inbound_nodes:
    - - - separable_conv_1_bn_reduction_right1_stem_2
        - 0
        - 0
        - {}
    name: activation_797
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 84
      kernel_size: *id003
      name: separable_conv_2_reduction_left1_stem_2
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: *id005
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_795
        - 0
        - 0
        - {}
    name: separable_conv_2_reduction_left1_stem_2
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 84
      kernel_size: *id004
      name: separable_conv_2_reduction_right1_stem_2
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: *id005
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_797
        - 0
        - 0
        - {}
    name: separable_conv_2_reduction_right1_stem_2
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_2_bn_reduction_left1_stem_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_2_reduction_left1_stem_2
        - 0
        - 0
        - {}
    name: separable_conv_2_bn_reduction_left1_stem_2
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_2_bn_reduction_right1_stem_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_2_reduction_right1_stem_2
        - 0
        - 0
        - {}
    name: separable_conv_2_bn_reduction_right1_stem_2
  - class_name: Activation
    config: {activation: relu, name: activation_798, trainable: true}
    inbound_nodes:
    - - - adjust_bn_stem_2
        - 0
        - 0
        - {}
    name: activation_798
  - class_name: Add
    config: {name: reduction_add_1_stem_2, trainable: true}
    inbound_nodes:
    - - - separable_conv_2_bn_reduction_left1_stem_2
        - 0
        - 0
        - &id021 {}
      - - separable_conv_2_bn_reduction_right1_stem_2
        - 0
        - 0
        - *id021
    name: reduction_add_1_stem_2
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 84
      kernel_size: *id007
      name: separable_conv_1_reduction_right2_stem_2
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: *id022
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_798
        - 0
        - 0
        - {}
    name: separable_conv_1_reduction_right2_stem_2
  - class_name: Activation
    config: {activation: relu, name: activation_800, trainable: true}
    inbound_nodes:
    - - - adjust_bn_stem_2
        - 0
        - 0
        - {}
    name: activation_800
  - class_name: Activation
    config: {activation: relu, name: activation_802, trainable: true}
    inbound_nodes:
    - - - reduction_add_1_stem_2
        - 0
        - 0
        - {}
    name: activation_802
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_1_bn_reduction_right2_stem_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_1_reduction_right2_stem_2
        - 0
        - 0
        - {}
    name: separable_conv_1_bn_reduction_right2_stem_2
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 84
      kernel_size: *id008
      name: separable_conv_1_reduction_right3_stem_2
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: *id023
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_800
        - 0
        - 0
        - {}
    name: separable_conv_1_reduction_right3_stem_2
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 84
      kernel_size: *id009
      name: separable_conv_1_reduction_left4_stem_2
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: *id024
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_802
        - 0
        - 0
        - {}
    name: separable_conv_1_reduction_left4_stem_2
  - class_name: Activation
    config: {activation: relu, name: activation_799, trainable: true}
    inbound_nodes:
    - - - separable_conv_1_bn_reduction_right2_stem_2
        - 0
        - 0
        - {}
    name: activation_799
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_1_bn_reduction_right3_stem_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_1_reduction_right3_stem_2
        - 0
        - 0
        - {}
    name: separable_conv_1_bn_reduction_right3_stem_2
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9997
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: separable_conv_1_bn_reduction_left4_stem_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - separable_conv_1_reduction_left4_stem_2
        - 0
        - 0
        - {}
    name: separable_conv_1_bn_reduction_left4_stem_2
  - class_name: SeparableConv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      depth_multiplier: 1
      depthwise_constraint: null
      depthwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      depthwise_regularizer: null
      dilation_rate: *id002
      filters: 84
      kernel_size: *id007
      name: separable_conv_2_reduction_right2_stem_2
      padding: same
      pointwise_constraint: null
      pointwise_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      pointwise_regularizer: null
      strides: *id005
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - activation_799
        - 0
        - 0
        - {}
    name: separable_conv_2_reduction_right2_stem_2
  - class_name: Activation
    config: {activation: relu, name: activation_801, trainable: true}
    inbound_nodes:
    - - - separable_conv_1_bn_reduction_right3_stem_2
        - 0
        - 0
        - {}
    name: activation_801
  - class_name: Activation
    config: {activation: relu, name: activation_803, trainable: true}
    inbound_nodes:
